# TextFailures Properties

---
The BuiltInFailuresTextFailures type exposes the following members.
| Name| Description
---|---|---
| CannotCreateModeltext|  Can't create Model Text.
| ModeltextIsEmpty|  Model Text deleted because it consists entirely of spaces and/or carriage returns.
Top
#### Reference
BuiltInFailuresTextFailures Class
Autodesk.Revit.DB Namespace